app/views/proposals/_form.html.erb

SELECT "hashtags"."text" FROM "hashtags" WHERE "hashtags"."proposal_id" = $1  [["proposal_id", 11]]
---
    			<br>
    			<input placeholder="#關鍵字標籤", name="hashtags", value="<%= @proposal.hashtags.pluck(:text).join(" ") %>">