app/views/proposals/_proposal.html.erb

  <div class="hashtag">
    <%= @proposal.hashtags.pluck(:text)[0..2].join(" ") %><br>
---
SELECT "hashtags"."text" FROM "hashtags" WHERE "hashtags"."proposal_id" = $1  [["proposal_id", 13]]