app/views/proposals/index.html.erb

  		<div class="sentence">
  			<%= proposal.hashtags.pluck(:text).join(" ") %>
---
SELECT "hashtags"."text" FROM "hashtags" WHERE "hashtags"."proposal_id" = $1  [["proposal_id", 13]]