app/controllers/proposals_controller.rb

  def index
    @proposals = Proposal.published
    if current_user&.proposal
      if @proposals.include? current_user.proposal
---
SELECT  "proposals".* FROM "proposals" WHERE "proposals"."user_id" = $1 LIMIT $2  [["user_id", 6], ["LIMIT", 1]]

  def create
    @proposal = Proposal.new(proposal_params)
    @proposal.user = current_user
    # hash_tags_process(@proposal)
    if params[:submit_proposal]
      if @proposal.id.nil?
        render :new, notice: "請先儲存提案再提交您的提案"
      else
        if proposal_check
          @proposal.is_submit = true
          @proposal.publish = false
          @proposal.save!
---
INSERT INTO "proposals" ("title", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "好提案"], ["created_at", 2017-08-05 09:47:31 UTC], ["updated_at", 2017-08-05 09:47:31 UTC], ["user_id", 1]]

  def update
    # hash_tags_process(@proposal)
    @proposal.hashtags.delete_all
    @proposal.assign_attributes(proposal_params)
    @proposal.publish = false
    @proposal.is_submit = false
    if params[:submit_proposal]
      @proposal.save!
---
INSERT INTO "hashtags" ("text", "proposal_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["text", "#八嘎久"], ["proposal_id", 11], ["created_at", 2017-08-09 07:54:25 UTC], ["updated_at", 2017-08-09 07:54:25 UTC]]
UPDATE "hashtags" SET "proposal_id" = NULL WHERE "hashtags"."proposal_id" = $1  [["proposal_id", 11]]
UPDATE "proposals" SET "description" = $1, "action_name" = $2, "action_intro" = $3, "action_location" = $4, "how_can_we" = $5, "excitement" = $6, "is_submit" = $7, "publish" = $8, "updated_at" = $9 WHERE "proposals"."id" = $10

  def destroy
    @proposal.destroy
---
DELETE FROM "proposals" WHERE "proposals"."id" = $1  [["id", 1]]

  def random_proposal
    @proposal = Proposal.published.order("RANDOM()").limit(1).first
---
SELECT  "proposals".* FROM "proposals" ORDER BY RANDOM() LIMIT $1  [["LIMIT", 1]]

    def set_proposal
      @proposal = Proposal.find(params[:id])
---
SELECT  "proposals".* FROM "proposals" WHERE "proposals"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]